URL_shortener/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "yQPjjwOd7kM286vDhd0UHg"], ["LIMIT", 1]]
---
  def self.random_code
    random = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(short_url: random)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.create!(user, long_url)
    random = ShortenedUrl.random_code
    concat_url = "Http://www.samodonnellsfanclub.com/#{random}"
    new_url = ShortenedUrl.new(long_url: long_url, short_url: concat_url, user_id: user.id)
    new_url.save!