URL_shortener/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["short_url_id", 7], ["created_at", "2019-01-24 01:36:00.990871"], ["updated_at", "2019-01-24 01:36:00.990871"]]
---
  def self.record_visit!(user, short_url)
    new_visit = Visit.new(user_id: user.id, short_url_id: short_url.id)
    new_visit.save